    module physical_properties
    use variables
    contains




    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    subroutine coolant_physical_properties(n_a)
    integer n_a
    if (module_identification==1) then
        coolant_Cp=(159.0-0.0272*coolant_T_in+7.12e-6*coolant_T_in**2)
        coolant_speed=4.56
        coolant_V_flow=coolant_speed*(pitch**2.-pi/4.*d(1,n_a,n_radial+2)**2.)
        coolant_M_flow=(11096.0-1.3236*623.15)*coolant_V_flow
    else
        coolant_Cp=(159.0-0.0272*coolant_T_in+7.12e-6*coolant_T_in**2)
        coolant_speed=4.56
        coolant_V_flow=coolant_speed*(pitch**2.-pi/4.*d(1,n_a,n_radial+2)**2.)
        coolant_M_flow=(11096.0-1.3236*623.15)*coolant_V_flow
    end if
    end subroutine
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!冷却剂物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!






    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    subroutine fuel_physical_properties
    UO2_idealdensity=10.96*10.**3
    fuel_percentage=0.95
    UO2_density=UO2_idealdensity*fuel_percentage
    UO2_Cp=328.8
    end subroutine
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!芯块物性及相关参数计算!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!



    end module physical_properties